## Data Pre-processing

In [3]:
# !pip install pyarrow

Requirement already satisfied: pyarrow in c:\users\40101410\appdata\roaming\python\python39\site-packages (14.0.1)
Requirement already satisfied: numpy>=1.16.6 in c:\users\40101410\appdata\roaming\python\python39\site-packages (from pyarrow) (1.22.4)

DEPRECATION: pyodbc 4.0.0-unsupported has a non-standard version number. pip 24.0 will enforce this behaviour change. A possible replacement is to upgrade to a newer version of pyodbc or contact the author to suggest that they release a version with a conforming version number. Discussion can be found at https://github.com/pypa/pip/issues/12063

[notice] A new release of pip is available: 23.3.1 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

### 1. Importing libraries

In [1]:
import pandas as pd

import seaborn as sns

import os
import matplotlib.pyplot as plt

import numpy as np
import sidetable

In [6]:
os.getcwd()

'C:\\Users\\40101410\\OneDrive - Anheuser-Busch InBev\\Upskill2024'

In [7]:
os.listdir()

['.git',
 '.ipynb_checkpoints',
 'Data',
 'data.parquet',
 'direct-marketing-eda.ipynb',
 'direct-marketing-pre-processing.ipynb',
 'README.md']

In [9]:
# Saving data for further pre-processing
df = pd.read_parquet('data.parquet', engine='pyarrow')
df.head()

,Age,Gender,OwnHome,Married,Location,Salary,Children,History,Catalogs,AmountSpent
0,Old,Female,Own,Single,Far,47500,0,High,6,755
1,Middle,Male,Rent,Single,Close,63600,0,High,6,1318
2,Young,Female,Rent,Single,Close,13500,0,Low,18,296
3,Middle,Male,Own,Married,Close,85600,1,High,18,2436
4,Middle,Female,Own,Single,Close,68400,0,High,12,1304